JesusFuente/MCU/Projecte_Integrador_30_05_18.X/dsPICDEM_MC1.c
    _TRISG6 = 1;   //puerto PButton S4 como entrada
    _TRISG7 = 1;   //puerto PButton S5 como entrada
    _TRISG8 = 1;   //puerto PButton S6 como entrada
    _TRISG9 = 1;   //puerto PButton S7 como entrada
    
    _CN8PUE = 1;   //Desactiva pullups en CN8
    _CN8IE = 1;    //Activa interrupcion en PB_S4 (CN8)
    _CN9PUE = 1;   //Desactiva pullups en CN9
    _CN9IE = 1;    //Activa interrupcion en PB_S5 (CN9)
    _CN10PUE = 1;  //Desactiva pullups en CN10
    _CN10IE = 1;   //Activa interrupcion en PB_S6 (CN10)
    _CN11PUE = 1;  //Desactiva pullups en CN11
    _CN11IE = 1;   //Activa interrupcion en PB_S7 (CN11)
    
    PORTG_PRE = PORTG;  // Guarda estado anterior
    _CNIF = 0;          // Borra Flag Interrupcion
    _CNIP = 3;          // Establece interrupcion prioridad 3
    _CNIE = 1;          // Activa interrupciones CN
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Interrupcion Generada por pulsadores

void __attribute__((interrupt, no_auto_psv)) _CNInterrupt (void)
{
	unsigned int BitsChange;
    char PBnum=0, PBsts=0;
    
    BitsChange = PORTG ^ PORTG_PRE;    // Cambio de pulsadores    
    if (BitsChange & 0x0040)           // Pulsador S4
    {
        PBnum=4;
        if (!PBUTTON_S4) PBsts=1; 
        else PBsts=0; 
    }
    if (BitsChange & 0x0080)           // Pulsador S5
    {
        PBnum=5;
        if (!PBUTTON_S5) PBsts=1;
        else PBsts=0;
    }
    if (BitsChange & 0x0100)           // Pulsador S6
    {
        PBnum=6;
        if (!PBUTTON_S6) PBsts=1;
        else PBsts=0;
    }
    if (BitsChange & 0x0200)           // Pulsador S7
    {
        PBnum=7;
        if (!PBUTTON_S7) PBsts=1;
        else PBsts=0;
    }
    
    if (PBFn) PBFn(PBnum,PBsts);
    PORTG_PRE = PORTG;      // Guarda estado anterior
    _CNIF = 0;              // Borra Flag Interrupcion
}
//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Inicializa entrada analógica AN7 conectada a potenciometro VR2

void IniVR2(void)
{
    ADPCFG |= 0xFF7F;   // RB7/AN7=Analog
    ADCON1 = 0x00E0;    // SSRC=111 Internal counter ends sampling and starts conversion
    ADCON2 = 0x0004;    // Interrupcion cada 2 muestras
    ADCON3 = 0x0F00;    // Sample time = 15Tad, Tad = internal Tcy/2
    ADCHS  = 0x0007;    // Conecta AN7 al CH0
    ADCSSL = 0;         // Inputs no scanned
    _ASAM = 1;          // Auto start sampling
    
    
    _ADON = 1;          // turn ADC ON
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Genera tiempo de Espera
// ciclos = (14 x count) + 24 , Tiempo=ciclos/FCY 

void Wait(long count)
{
    while(count--);
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Genera secuencia de arranque especifica para el driver HD44780
// Se configura para 4 bits de datos, dos lineas, 5x8 puntos/caracter

void IniLCD(void)
{
   Wait(Delay_20ms);    
   LATD = (LATD&0xFFF0)|0x0003; //Funcion set interface 8 bits
   TRISD = TRISD&0xFFF0;        //Puerto de datos como salida    
   LCDRW = 0;                   //R/!W escribir
   LCDENA = 1;                  //Alterna señal enable
   Wait(Delay_200us);
   LCDENA = 0;

   Wait(Delay_10ms);
   LATD = (LATD&0xFFF0)|0x0003; //Funcion set interface 8 bits 
   LCDENA = 1;                  //Alterna señal enable
   Wait(Delay_200us);
   LCDENA = 0;

   Wait(Delay_1ms);
   LATD = (LATD&0xFFF0)|0x0003; //Funcion set interface 8 bits
   LCDENA = 1;                  //Alterna señal enable
   Wait(Delay_200us);
   LCDENA = 0;
   
   Wait(Delay_1ms);
   LATD = (LATD&0xFFF0)|0x0002; //Funcion set interface 4 bits
   LCDENA = 1;                  //Alterna señal enable
   Wait(Delay_200us);
   LCDENA = 0;
    
                 
   WriteCmdLCD(0x28);   // Function set: 4 bits, 2 lineas, 5x8 puntos                               
   WriteCmdLCD(0x06);   // Entry Mode: Incr 1, NO shift
   WriteCmdLCD(0x0C);   // LCD ON, Cursor OFF, NO blink
   WriteCmdLCD(0x01);   // Borra LCD
   WriteCmdLCD(0x80);   // Cursor al inicio
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Retorna estado de ocupado del LCD

char BusyLCD(void)
{
    char fbusy;
    TRISD = TRISD|0x000F;   // Puerto de datos como entrada
    LCDRS = 0;
    LCDRW = 1;              // R/!W leer    
    Wait(Delay_200us);
    LCDENA = 1;
    Wait(Delay_200us);        // Espera datos del LCD
    
    if(LCDD3) {fbusy = 1;}  // Lee el flag de busy
    else      {fbusy = 0;}
    
    LCDENA = 0;
    Wait(Delay_200us);
    LCDRW = 0;              // R/!W escribir 
    return fbusy;
} 


//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Escribe un comando al registro de instrucciones del LCD

void WriteCmdLCD(char cmd)
{
    char cmdTemp;
    cmdTemp = cmd;
    
    while(BusyLCD());       // Esperar lcd listo
	
    LCDRS = 0;              // Seleccion registro instruccion
    LCDRW = 0;              // R/!W escribir
    
    // Parte alta del byte
    LATD = (LATD & 0xFFF0) | (cmdTemp >> 4 & 0x000F); 
    TRISD = TRISD&0xFFF0;        //Puerto de datos como salida 
    LCDENA = 1;
    Wait(Delay_200us);
    LCDENA = 0;
    Wait(Delay_200us);
    
    // Parte baja del byte
    LATD = (LATD & 0xFFF0) | (cmd & 0x000F);
    LCDENA = 1;
    Wait(Delay_200us);
    LCDENA = 0;
    Wait(Delay_200us);
    
    TRISD = TRISD|0x000F;   // Puerto de datos como entrada
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Escribe un comando al registro de datos del LCD

void WriteDataLCD(char data)
{
    char dataTemp=data;
   
    while(BusyLCD());       // Esperar lcd listo
	
    LCDRS = 1;              // Seleccion registro Datos
    LCDRW = 0;              // R/!W escribir
    
    // Parte alta del byte
    LATD = (LATD & 0xFFF0) | (dataTemp >> 4 & 0x000F); 
    TRISD = TRISD&0xFFF0;        //Puerto de datos como salida 
    LCDENA = 1;
    Wait(Delay_200us);
    LCDENA = 0;
    Wait(Delay_200us);
    
