JesusFuente/MCU/Projecte_Integrador_30_05_18.X/dsPICDEM_MC1.c
    // Parte baja del byte
    LATD = (LATD & 0xFFF0) | (data & 0x000F);
    LCDENA = 1;
    Wait(Delay_200us);
    LCDENA = 0;
    Wait(Delay_200us);
    
    TRISD = TRISD|0x000F;   // Puerto de datos como entrada
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Borra el LCD

void DeleteLCD(void)
{
    while(BusyLCD());    // Esperar lcd listo
    WriteCmdLCD(0x01);   // Borra LCD
    WriteCmdLCD(0x80);   // Cursor al inicio
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Posiciona curson en columna, fila
// col: posicion columna inicio
// row: posicion fila inicio

void PosLCD(char col, char row)
{
	WriteCmdLCD(0x80|col|(row << 6)); //Set DDRAM address
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Escribe texto en LCD empezando por columna, fila
// buffer: cadena de caracteres
// col: posicion columna inicio
// row: posicion fila inicio

void WriteTxtLCD(char *buffer, char col, char row)
{
    PosLCD(col,row);
    while(*buffer!='\0')
    {
        WriteDataLCD(*buffer);
        buffer++;
    }
    Wait(Delay_200ms);
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Escribe numero en LCD con formato especificado
// number: numero a escribir
// len: longitud
// dec: numero decimales
// col: posicion columna inicio
// row: posicion fila inicio

void WriteNumLCD(float number,int len,int dec,char col,char row)
{
    char buffer[17];
    int i=0;
      
    sprintf(buffer, "%*.*f", len,dec,(double)number);    
    PosLCD(col,row);    
    while(buffer[i]!='\0')
    {
        WriteDataLCD(buffer[i]);
        i++;
    }
    Wait(Delay_200ms);
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Inicializa posicion Hall
// AttnFunction: funcion de atencion a la interrupcion (opcional)

void IniHall(void(*AttnFunction)())
{
    HallFn=AttnFunction;    //Función de atención a la irq
            
    IC1CON=1;       // Capture mode, every edge
    IC2CON=1;       // Capture mode, every edge
    IC3CON=1;       // Capture mode, every edge
    
    _TRISD8 = 1;    // Puerto CAP1 como entrada
    _TRISD9 = 1;    // Puerto CAP2 como entrada
    _TRISD10 = 1;   // Puerto CAP3 como entrada
    
    _IC1IF = 0;     // Borra Flag Interrupcion IC1
    _IC2IF = 0;     // Borra Flag Interrupcion IC2
    _IC3IF = 0;     // Borra Flag Interrupcion IC3
    
    _IC1IP = 4;     // Interrupcion prioridad 4 IC1
    _IC2IP = 4;     // Interrupcion prioridad 4 IC2
    _IC3IP = 4;     // Interrupcion prioridad 4 IC3
    
    _IC1IE = 1;     // Activa interrupciones IC1
    _IC2IE = 1;     // Activa interrupciones IC2
    _IC3IE = 1;     // Activa interrupciones IC3
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Interrupciones Generadas posiciones Hall

void __attribute__((interrupt, no_auto_psv)) _IC1Interrupt (void)
{
    OutMngr();
    if (HallFn) HallFn();       //Si hay funcion configurada se ejecuta
    _IC1IF = 0;
}

void __attribute__((interrupt, no_auto_psv)) _IC2Interrupt (void)
{
    OutMngr();
    if (HallFn) HallFn();       //Si hay funcion configurada se ejecuta
    _IC2IF = 0;
}

void __attribute__((interrupt, no_auto_psv)) _IC3Interrupt (void)
{
	OutMngr();
    if (HallFn) HallFn();       //Si hay funcion configurada se ejecuta
    _IC3IF = 0;
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Inicializa control PWM con control de fallo FLTA por interrupcion
// AttnFunction: funcion de atencion a la interrupcion de fallo (opcional)

void IniPWM(void(*AttnFunction)())
{
    DrvFailFn=AttnFunction; //Función de atención a la irq
    
    PTCON = 0x0000;			// Tiempo base en "free running" sin escalados   
    OVDCON = 0x0000;		// Desactiva salidas
    PTPER = (FCY/FPWM)-1;   // Tiempo base del periodo
    SEVTCMP = PTPER;        // Tiempo base del evento especial (ADC)
    PWMCON1 = 0x0700;		// Salidas sin control PWM
    PWMCON2 = 0x0F00;		// Postscale x16 evento especial (ADC) (no usado)
    DTCON1 = 0x0000;        // No hace falta deadtime (cambios diagonales)
    DTCON2 = 0x0000;
    FLTACON = 0x0007;       // Posicion fallo todo desconectado
    
    _FLTAIP = 4;            // Interrupcion prioridad 4 FLTA
    _FLTAIF = 0;            // Borra Flag Interrupcion FLTA    
    
    _PTEN = 1;              // Arranca PWM
    
    SetDC(0);               // DutyC a 0%
    
    if (DRVFAIL)
    {
        Motor.fault=1;                  //Flag Motor en fallo
        if (DrvFailFn)  DrvFailFn();    //Si hay funcion configurada se ejecuta
    }
    else    _FLTAIE = 1;    // Activa interrupciones FLTA
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Interrupcion Generadas fallo Driver FLTA

void __attribute__((interrupt, no_auto_psv)) _FLTAInterrupt (void)
{
    _FLTAIE = 0;            // Desactiva interrupciones FLTA
    PWMCON1 = 0x0700;		// Salidas desactivadas
    Motor.fault=1;          // Flag Motor en fallo
    Motor.running=0;        // Flag Motor parado
    if (DrvFailFn)  DrvFailFn();
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Gestiona la activacion de las salidas al motor

void OutMngr(void)
{
    int HV;      //Lee posicion actual
    HV=(int)(PORTD & 0x0700) >>8;
        
    if (!DRVFAIL)       //Si no está en fallo
    {
        //Activa las salidas apropiadas segun la posicion actual
        // y el sentido de giro
        if (Motor.direction)    OVDCON = StepTableREV[HV];
        else                    OVDCON = StepTableDIR[HV];
        
        PFC=1;
    }
}

