JesusFuente/MCU/Projecte_Integrador_30_05_18.X/dsPICDEM_MC1.c
//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Arranca PWM

void StartPWM(void)
{
    if (!DRVFAIL)       //Si no está en fallo
    {
        OutMngr();   
        PWMCON1 = 0x0777;		// Salidas independientes habilitadas para PWM
        Motor.running=1;        // Flag Motor en marcha
    }
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Para PWM

void StopPWM(void)
{
    PWMCON1 = 0x0700;		// Salidas desactivadas
    Motor.running=0;        // Flag Motor parado
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Resetea fallo Driver motor
// Retorna 1 si se ha reseteado con exito

char RstDriver(void)
{
    DRVRST=1;
    //Wait(Delay_RST); 
    DRVRST=0;
    if (!DRVFAIL)
    {
        Motor.fault=0;  //Flag Motor en fallo
        _FLTAIF = 0;    //Borra Flag Interrupcion FLTA
        _FLTAIE = 1;    //Activa interrupciones FLTA
        return 1;
    }
    else return 0;
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Establece valor de Duty-Cycle
// DC: Valor de Duty-Cycle en % (+ giro directo, - giro inverso)

void SetDC(float DC)
{
    if (DC>=0)
    {
        Motor.direction=0;
        if (DC>100)   DC=100;
    }
    else
    {
        Motor.direction=1;
        DC=-DC;
        if (DC>100)   DC=100;
    }
    Motor.dcycle=DC;
    PDC1 = (unsigned int)(DC*(FCY/FPWM)/50.0);
    PDC2 = PDC1;
	PDC3 = PDC1;
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Inicializa encoder con filtro de entrada y temporizador T1 pra calc. veloc.
// AttnIndxFunc: funcion de atencion a la interrupcion de paso por INDX (opci)

void IniQEI(void(*AttnFunction)())
{
    EncIndxFn=AttnFunction; //Función de atención a la irq
    
	ADPCFG |= 0x0038; // Configura QEI pins como digital
    
    // QEICON - QEI Control Register
    // x4 mode con reset de contador por contaje max
    // Indicacion direccion en LED
   	QEICON = 0x0740;
    
	// DFLTCON - Digital Filter Control Register
    // Interrupcion error contaje activo
    // Pulso Minimo=30/(RPM*IPR)=30/(4000*1000)= 7.5us
    // Filtro = (FCY*Pulso Minimo)/3 => (14.75M*7.5u)/3=36.87
    // 36.87 -> 1:32 -> Se filtran pulsos<6.5uS
   	DFLTCON = 0x00EE;    
    
    POSCNT = 0;    // Inicializa Contaje
	MAXCNT = IPR;  // Contaje maximo

    _QEIIP = 4;    // Interrupcion prioridad 4
    _QEIIF = 0;    // Borra Flag Interrupcion QEI
    _QEIIE = 1;    // Activa interrupciones QEI
    
    //INICIALIZA TIMER 1 PARA CALCULO VELOCIDAD
    //Calculo de PR con prescalado a 8
    unsigned int PRSPE=(SPESTM*FCY)/8;
    
    T1CON = 0X0010; // TCY interno prescalado 8
    TMR1 = 0;       // Reset timer    
    PR1 = PRSPE;       
    _T1IF = 0;      // Borra Flag Interrupcion T1
    _T1IE = 1;      // Activa interrupciones T1
    T1CONbits.TON = 1;       // Activa T1
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Interrupcion Generadas ENCODER (POR CNTERR O INDEX)

void __attribute__((interrupt, no_auto_psv)) _QEIInterrupt (void)
{
    if (_UPDN)
        {
            Sp_Acc_Revol++;     //Incrementa revoluciones calc vel
            Po_Acc_Revol++;     //Incrementa revoluciones calc pos
        }
    else 
        {
            Sp_Acc_Revol--;     //Decrementa revoluciones calc vel
            Po_Acc_Revol--;     //Decrementa revoluciones calc pos
        }
        
    if (EncIndxFn)  EncIndxFn();
    
    _QEIIF = 0;    //Borra Flag Interrupcion QEI
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Interrupcion Generadas T1
// Calcula velocidad instantanea RPM y la posicion en grad

void __attribute__((interrupt, no_auto_psv)) _T1Interrupt (void)
{
    //Calculo velocidad en RPM
    int PosInc=POSCNT-POSCNT_PRE+(Sp_Acc_Revol*IPR);    
    Motor.speed=(60.0*PosInc)/(SPESTM*IPR);            
    POSCNT_PRE=POSCNT;
    Sp_Acc_Revol=0;
    
    PosUpdate();        //Actualiza Info posicion
    
    _T1IF = 0;          //Borra Flag Interrupcion
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Actualiza posicion absoluta Encoder

void PosUpdate(void)
{
    float count;
    //Calculo posicion en grados
    Motor.ecount=POSCNT+(Po_Acc_Revol*IPR);
    count=(float)Motor.ecount;
    Motor.position=(360.0*count)/IPR; 
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Resetea posicion inicial Encoder

void RstQEI(void)
{
    POSCNT = 0;
    Po_Acc_Revol=0;
    Motor.ecount=0;
    Motor.position=0;
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Inicializa Timer 4 para intermitencia (500 ms)

void iniTimerBlink(void(*AttnFunction)()){
  //prescalado a 256
  //tiempo muestreo 500 ms;
  
  BlinkTmFn=AttnFunction; //Función de atención a la irq
    
  T4CON=0x8030;   // TCY interno prescalado 256
  TMR4=0;         // Reset timer
  PR4=31250;
  _T4IE = 1;
  _T4IF = 0;
  T4CONbits.TON = 1;       // Activa T4
}

//---------------------------------------------------------------------
//---------------------------------------------------------------------
// Interrupcion Generada por temporizador T4 (500 ms)

void __attribute__((interrupt, no_auto_psv)) _T4Interrupt (void)
{
    if (BlinkTmFn)  BlinkTmFn();
    _T4IF = 0;          //Borra Flag Interrupcion
}


